# Import Packages

**Connect Sql Workbench**

In [1]:
%load_ext sql
%sql mysql+pymysql://root:03251014@localhost/dannys_dinner

**Show All Tables**

In [2]:
%%sql
show tables;

 * mysql+pymysql://root:***@localhost/dannys_dinner
3 rows affected.

[('members',), ('menu',), ('sales',)]

**Entity Relationship Diagram**

In [3]:
%%html
<iframe height="400" width="100%" src='https://dbdiagram.io/embed/608d07e4b29a09603d12edbd'> 
</iframe>

# Case Analysis

## What is the total amount each customer spent at the restaurant?

In [4]:
%%sql
SELECT
  s.customer_id,SUM(m.price) AS total_sales
FROM sales s INNER JOIN menu m USING(product_id)
GROUP BY s.customer_id
ORDER BY s.customer_id;

 * mysql+pymysql://root:***@localhost/dannys_dinner
3 rows affected.

[('A', Decimal('76')), ('B', Decimal('74')), ('C', Decimal('36'))]

## How many days has each customer visited the restaurant?

In [5]:
%%sql
SELECT
  customer_id,
  COUNT(DISTINCT(order_date)) AS count
FROM
  sales
GROUP BY 1;

 * mysql+pymysql://root:***@localhost/dannys_dinner
3 rows affected.

[('A', 4), ('B', 6), ('C', 2)]

## What was the first item from the menu purchased by each customer?

In [6]:
%%sql
SELECT DISTINCT(customer_id), 
       product_name FROM sales s
JOIN menu m 
ON m.product_id = s.product_id
WHERE s.order_date = ANY 
      (
       SELECT MIN(order_date) 
       FROM sales 
       GROUP BY customer_id
      )

 * mysql+pymysql://root:***@localhost/dannys_dinner
4 rows affected.

[('A', 'sushi'), ('A', 'curry'), ('B', 'curry'), ('C', 'ramen')]

## What is the most purchased item on the menu and how many times was it purchased by all customers?

In [7]:
%%sql
SELECT product_name, COUNT(product_name) AS total_purchases
FROM sales s JOIN menu m USING(product_id)
GROUP BY product_name
ORDER BY total_purchases DESC
LIMIT 1;

 * mysql+pymysql://root:***@localhost/dannys_dinner
1 rows affected.

[('ramen', 8)]

## Which item was the most popular for each customer? <p>
**Note:**

| Question | Explain | 
|---|---|
|item | m.product_name |  
|customer | s.customer_id |  
|most popular item | ORDER BY COUNT(s.product_id) DESC |  
|for each customer| PARTITION BY s.customer_id |

In [8]:
%%sql
WITH customer_cte AS 
( 
SELECT s.customer_id,
       m.product_name, 
       COUNT(s.product_id) as item_quantity, 
       DENSE_RANK() OVER (PARTITION BY s.customer_id ORDER BY COUNT(s.product_id) DESC) AS item_rank 
FROM menu m JOIN sales s ON s.product_id = m.product_id 
GROUP BY s.customer_id, s.product_id, m.product_name 
) 
SELECT customer_id, product_name, item_quantity 
FROM customer_cte 
WHERE item_rank = 1

 * mysql+pymysql://root:***@localhost/dannys_dinner
5 rows affected.

[('A', 'ramen', 3),
 ('B', 'curry', 2),
 ('B', 'sushi', 2),
 ('B', 'ramen', 2),
 ('C', 'ramen', 3)]

**Notes:**

| Function | Explain | 
|---|---|
|ROW_NUMBER | Not repeat sorting | 
|RANK() | Repeats and jumps number sorting | 
|DENSE_RANK() | Repeats and does not jump number sorting |

## Which item was purchased first by the customer after they became a member?
**Note:**

| Question | Explain | 
|---|---|
|item | m.product_name |  
|customer | s.customer_id |  
|item purchased first | ORDER BY s.order_date |  
|for each customer| PARTITION BY s.customer_id |  
|after they became a member| s.order_date >= mem.join_date |

In [10]:
%%sql
WITH ranks AS
(
SELECT s.customer_id,
       m.product_name,
       DENSE_RANK() OVER (PARTITION BY s.customer_id ORDER BY s.order_date) AS ranks
FROM sales s
JOIN menu m ON s.product_id = m.product_id
JOIN members AS mem ON mem.customer_id = s.customer_id
WHERE s.order_date >= mem.join_date
)
SELECT * FROM ranks
WHERE ranks = 1

 * mysql+pymysql://root:***@localhost/dannys_dinner
2 rows affected.

[('A', 'curry', 1), ('B', 'sushi', 1)]

## Which item was purchased just before the customer became a member?

In [15]:
%%sql
WITH ranks AS
(
SELECT s.customer_id,
       s.order_date,
       m.product_name,
       DENSE_RANK() OVER (PARTITION BY s.customer_id ORDER BY s.order_date) AS ranks, 
       mem.join_date
FROM sales s
JOIN menu m ON s.product_id = m.product_id
JOIN members AS mem ON mem.customer_id = s.customer_id
WHERE s.order_date < mem.join_date
)
SELECT customer_id, order_date, product_name FROM ranks
WHERE ranks = 1

 * mysql+pymysql://root:***@localhost/dannys_dinner
3 rows affected.

[('A', '2021-01-01T00:00:00.000Z', 'sushi'),
 ('A', '2021-01-01T00:00:00.000Z', 'curry'),
 ('B', '2021-01-01T00:00:00.000Z', 'curry')]

## What is the total items and amount spent for each member before they became a member?

In [12]:
%%sql
SELECT s.customer_id,
       count(s.product_id) AS total_items, 
       SUM(price) AS money_spent
FROM sales AS s
JOIN menu AS m 
ON m.product_id = s.product_id
JOIN members AS mem 
ON s.customer_id = mem.customer_id
WHERE s.order_date < mem.join_date
GROUP BY s.customer_id

 * mysql+pymysql://root:***@localhost/dannys_dinner
2 rows affected.

[('B', 3, Decimal('40')), ('A', 2, Decimal('25'))]

## If each 1 dollar spent equates to 10 points and sushi has a 2x points multiplier - how many points would each customer have?

In [16]:
%%sql
WITH points AS 
(
SELECT *,
    CASE 
    WHEN m.product_name = 'sushi' THEN price * 20
    WHEN m.product_name != 'sushi' THEN price * 10
    END AS points
FROM menu m
    )
SELECT customer_id, SUM(points) AS points
FROM sales s
JOIN points p ON p.product_id = s.product_id
GROUP BY s.customer_id

 * mysql+pymysql://root:***@localhost/dannys_dinner
3 rows affected.

[('A', Decimal('860')), ('B', Decimal('940')), ('C', Decimal('360'))]

## In the first week after a customer joins the program (including their join date) they earn 2x points on all items, not just sushi - how many points do customer A and B have at the end of January?

In [16]:
%%sql
SELECT customer_id, SUM(total_points)
FROM 
(WITH points AS
(
SELECT s.customer_id, 
       (s.order_date - mem.join_date) AS first_week,
       m.price,
       m.product_name,
       s.order_date
FROM sales s
JOIN menu m ON s.product_id = m.product_id
JOIN members mem ON mem.customer_id = s.customer_id
)
SELECT customer_id,
       order_date
       CASE 
       WHEN first_week BETWEEN 0 AND 7 THEN price * 20
       WHEN (first_week > 7 OR first_week < 0) AND product_name = 'sushi' THEN price * 20
       WHEN (first_week > 7 OR first_week < 0) AND product_name != 'sushi' THEN price * 
       END AS total_points
FROM points
WHERE EXTRACT(MONTH FROM order_date) = 1
) as t
GROUP BY customer_id

 * mysql+pymysql://root:***@localhost/dannys_dinner
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'CASE \n       WHEN first_week BETWEEN 0 AND 7 THEN price * 20\n       WHEN (first_' at line 15")
[SQL: SELECT customer_id, SUM(total_points) FROM
(WITH points AS
(
SELECT s.customer_id,
       (s.order_date - mem.join_date) AS first_week,
       m.price,
       m.product_name,
       s.order_date
FROM sales s
JOIN menu m ON s.product_id = m.product_id
JOIN members mem ON mem.customer_id = s.customer_id
)
SELECT customer_id,
       order_date
       CASE
       WHEN first_week BETWEEN 0 AND 7 THEN price * 20
       WHEN (first_week > 7 OR first_week < 0) AND product_name = 'sushi' THEN price * 20
       WHEN (first_week > 7 OR first_week < 0) AND product_name != 'sushi' THEN price *
       END AS total_points
FROM points
WHERE EXTRACT(MONTH FROM order_date) = 1
) as t
GROUP BY customer_id]
(Background on this error at: http://sqlalche.me/e/f405)

**Reference**<p>
https://medium.com/@orkunaran/8-weeks-sql-challenge-case-study-week-1-dannys-diner-c90013af6797